Logs/artillery.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 21:36:35(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 21:36:36(-0300)

All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 21:36:42(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 236/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 85
  median: ...................................................................... 34.1
  p95: ......................................................................... 63.4
  p99: ......................................................................... 79.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 475.3
  max: ......................................................................... 1030.5
  median: ...................................................................... 837.3
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7